Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1064DAH169.atdf
      <value-group caption="Software Reset bit" name="CECON__SWRST">
         <value caption="Initiate a software reset of the Crypto Engine" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Swap Output Data Enable bit" name="CECON__SWAPOEN">
         <value caption="Output data is byte swapped when written by dedicated DMA" name="" value="0x1" />
         <value caption="Output data is not byte swapped when written by dedicated DMA" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Descriptor Processor Status bit" name="CESTAT__ACTIVE">
         <value caption="BDP is active" name="" value="0x1" />
         <value caption="BDP is idle" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Start Status bit" name="CESTAT__START">
         <value caption="DMA start has occurred" name="" value="0x1" />
         <value caption="DMA start has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Descriptor Processor State Status bits" name="CESTAT__BDSTATE">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="SA fetch" name="" value="0x6" />
         <value caption="Fetch BDP is disabled" name="" value="0x5" />
         <value caption="Descriptor is done" name="" value="0x4" />
         <value caption="Data phase" name="" value="0x3" />
         <value caption="BDP is loading" name="" value="0x2" />
         <value caption="Descriptor fetch request is pending" name="" value="0x1" />
         <value caption="BDP is idle" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Error Phase of DMA Status bits" name="CESTAT__ERRPHASE">
         <value caption="Destination data" name="" value="0x3" />
         <value caption="Source data" name="" value="0x2" />
         <value caption="Security Association (SA) access" name="" value="0x1" />
         <value caption="Buffer Descriptor (BD) access" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Error Operation Status bits" name="CESTAT__ERROP">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Authentication" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Decryption" name="" value="0x2" />
         <value caption="Encryption" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Error Mode Status bits" name="CESTAT__ERRMODE">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="CEK operation" name="" value="0x3" />
         <value caption="KEK operation" name="" value="0x2" />
         <value caption="Preboot authentication" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Crypto Engine Interrupt Pending Status bit" name="CEINTSRC__PENDIF">
         <value caption="Crypto Engine interrupt is pending (this value is the result of an OR of all interrupts in the Crypto Engine)" name="" value="0x1" />
         <value caption="Crypto Engine interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="BD Transmit Status bit" name="CEINTSRC__CBDIF">
         <value caption="Last BD transmit was processed" name="" value="0x1" />
         <value caption="Last BD transmit has not been processed" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Packet Completion Interrupt Status bit" name="CEINTSRC__PKTIF">
         <value caption="DMA packet was completed" name="" value="0x1" />
         <value caption="DMA packet was not completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Access Response Error Interrupt bit" name="CEINTSRC__AREIF">
         <value caption="Error occurred trying to access memory outside the Crypto Engine" name="" value="0x1" />
         <value caption="No error has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Interrupt Enable bit" name="CEINTEN__PENDIE">
         <value caption="Crypto Engine interrupts are enabled" name="" value="0x1" />
         <value caption="Crypto Engine interrupts are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor Interrupt Enable bit" name="CEINTEN__BDPIE">
         <value caption="BDP interrupts are enabled" name="" value="0x1" />
         <value caption="BDP interrupts are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Packet Completion Interrupt Enable bit" name="CEINTEN__PKTIE">
         <value caption="DMA packet completion interrupts are enabled" name="" value="0x1" />
         <value caption="DMA packet completion interrupts are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Access Response Error Interrupt Enable bit" name="CEINTEN__AREIE">
         <value caption="Access response error interrupts are enabled" name="" value="0x1" />
         <value caption="Access response error interrupts are not enabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01461" name="CTMU" version="1">
      <register-group name="CTMU">
         <register caption="CTMU Control Register" name="CTMUCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Current Range Select bits" mask="0x00000003" name="IRNG" values="CTMUCON__IRNG" />
            <bitfield caption="Current Source Trim bits" mask="0x000000FC" name="ITRIM" values="CTMUCON__ITRIM" />
            <bitfield caption="Trigger Control bit" mask="0x00000100" name="CTTRIG" values="CTMUCON__CTTRIG" />
            <bitfield caption="Analog Current Source Control bit" mask="0x00000200" name="IDISSEN" values="CTMUCON__IDISSEN" />
            <bitfield caption="Edge Sequence Enable bit" mask="0x00000400" name="EDGSEQEN" values="CTMUCON__EDGSEQEN" />
            <bitfield caption="Edge Enable bit" mask="0x00000800" name="EDGEN" values="CTMUCON__EDGEN" />
            <bitfield caption="Time Generation Enable bit" mask="0x00001000" name="TGEN" values="CTMUCON__TGEN" />
            <bitfield caption="Stop-in-Idle Mode bit" mask="0x00002000" name="CTMUSIDL" values="CTMUCON__CTMUSIDL" />
            <bitfield caption="ON Enable bit" mask="0x00008000" name="ON" values="CTMUCON__ON" />
            <bitfield caption="Edge 2 Source Select bits" mask="0x000F0000" name="EDG2SEL" values="CTMUCON__EDG2SEL" />
            <bitfield caption="Edge 2 Polarity Select bit" mask="0x00400000" name="EDG2POL" values="CTMUCON__EDG2POL" />
            <bitfield caption="Edge2 Edge Sampling Select bit" mask="0x00800000" name="EDG2MOD" values="CTMUCON__EDG2MOD" />
            <bitfield caption="Edge1 Status bit" mask="0x01000000" name="EDG1STAT" values="CTMUCON__EDG1STAT" />
            <bitfield caption="Edge2 Status bit" mask="0x02000000" name="EDG2STAT" values="CTMUCON__EDG2STAT" />
            <bitfield caption="Edge 1 Source Select bits" mask="0x3C000000" name="EDG1SEL" values="CTMUCON__EDG1SEL" />
            <bitfield caption="Edge 1 Polarity Select bit" mask="0x40000000" name="EDG1POL" values="CTMUCON__EDG1POL" />
            <bitfield caption="Edge1 Edge Sampling Select bit" mask="0x80000000" name="EDG1MOD" values="CTMUCON__EDG1MOD" />
         </register>
      </register-group>
      <value-group caption="Current Range Select bits" name="CTMUCON__IRNG">
         <value caption="100 times base current" name="" value="0x3" />
         <value caption="10 times base current" name="" value="0x2" />
         <value caption="Base current level" name="" value="0x1" />
         <value caption="1000 times base current(4)" name="" value="0x0" />
      </value-group>
      <value-group caption="Current Source Trim bits" name="CTMUCON__ITRIM">
         <value caption="Maximum positive change from nominal current" name="" value="0x1f" />
         <value caption="" name="" value="0x1e" />
         <value caption="Minimum positive change from nominal current" name="" value="0x1" />
         <value caption="Nominal current output specified by IRNG" name="" value="0x0" />
         <value caption="Minimum negative change from nominal current" name="" value="0x3f" />
         <value caption="" name="" value="0x22" />
         <value caption="Maximum negative change from nominal current" name="" value="0x21" />
      </value-group>
      <value-group caption="Trigger Control bit" name="CTMUCON__CTTRIG">
         <value caption="Trigger output is enabled" name="" value="0x1" />
         <value caption="Trigger output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Current Source Control bit" name="CTMUCON__IDISSEN">
         <value caption="Analog current source output is grounded" name="" value="0x1" />
         <value caption="Analog current source output is not grounded" name="" value="0x0" />
      </value-group>
